
// Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее

// Console.WriteLine("введите два числа");
// int a = int.Parse(Console.ReadLine()), b = int.Parse(Console.ReadLine());
// if (a >= b){
//     Console.WriteLine($"max = {a}");
// }
// else{
//     Console.WriteLine($"max = {b}");
// }


// напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел

// Console.WriteLine("введите три числа");
// int a = int.Parse(Console.ReadLine()), b = int.Parse(Console.ReadLine()), c = int.Parse(Console.ReadLine());
// int max = a;
// if (b > a) max = b;
// if (c > max) max = c;
// Console.WriteLine(max);

// напишите программу, котораяна вход принимает число и выдаёт, является ли число четным

// Console.WriteLine("введите число");
// int digit = int.Parse(Console.ReadLine());
// if (digit % 2 == 0){
//     Console.WriteLine("да");
// }
// else{
//     Console.WriteLine("нет");
// }

// напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N

// Console.WriteLine("введите число N");
// int N = int.Parse(Console.ReadLine());
// for (int i = 1; i <= N; i++){
//     if (i % 2 == 0){
//         Console.Write(i);
//     }
//     Console.Write(' ');
// }